In [1]:
people = {
    "first": ["Mohamed", 'Ahmed', 'Eslam'], 
    "last": ["El-sadek", 'Mohamed', 'Ahmed'], 
    "email": ["MohamedEl-sadek@gmail.com", 'AhmedMohamed@email.com', 'EslamAhmed@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

     first      last                      email
0  Mohamed  El-sadek  MohamedEl-sadek@gmail.com
1    Ahmed   Mohamed     AhmedMohamed@email.com
2    Eslam     Ahmed       EslamAhmed@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['first_name', 'last_name', 'email']

In [7]:
df

  first_name last_name                      email
0    Mohamed  El-sadek  MohamedEl-sadek@gmail.com
1      Ahmed   Mohamed     AhmedMohamed@email.com
2      Eslam     Ahmed       EslamAhmed@email.com

In [8]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                      email
0    Mohamed  El-sadek  MohamedEl-sadek@gmail.com
1      Ahmed   Mohamed     AhmedMohamed@email.com
2      Eslam     Ahmed       EslamAhmed@email.com

In [9]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [10]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']

In [11]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [12]:
df

     first      last                      email
0  Mohamed  El-sadek  MohamedEl-sadek@gmail.com
1    Ahmed   Mohamed     AhmedMohamed@email.com
2     John       Doe          JohnDoe@email.com

In [13]:
df.loc[2, 'last'] = 'Smith'

In [14]:
df

     first      last                      email
0  Mohamed  El-sadek  MohamedEl-sadek@gmail.com
1    Ahmed   Mohamed     AhmedMohamed@email.com
2     John     Smith          JohnDoe@email.com

In [15]:
df.at[2, 'last'] = 'Doe'

In [16]:
df

     first      last                      email
0  Mohamed  El-sadek  MohamedEl-sadek@gmail.com
1    Ahmed   Mohamed     AhmedMohamed@email.com
2     John       Doe          JohnDoe@email.com

In [17]:
filt = (df['email'] == 'JohnDoe@email.com')
df[filt]['last'] = 'Smith'

C:\Users\dell\AppData\Local\Temp\ipykernel_12660\1842663546.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith'

In [18]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'

In [19]:
df['email'] = df['email'].str.lower()

In [20]:
df

     first      last                      email
0  Mohamed  El-sadek  mohamedel-sadek@gmail.com
1    Ahmed   Mohamed     ahmedmohamed@email.com
2     John     Smith          johndoe@email.com

In [21]:
df['email'].apply(len)

0    25
1    22
2    17
Name: email, dtype: int64

In [22]:
def update_email(email):
    return email.upper()

In [23]:
df['email'].apply(update_email)

0    MOHAMEDEL-SADEK@GMAIL.COM
1       AHMEDMOHAMED@EMAIL.COM
2            JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [24]:
df['email'] = df['email'].apply(update_email)

In [25]:
df

     first      last                      email
0  Mohamed  El-sadek  MOHAMEDEL-SADEK@GMAIL.COM
1    Ahmed   Mohamed     AHMEDMOHAMED@EMAIL.COM
2     John     Smith          JOHNDOE@EMAIL.COM

In [26]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [27]:
df

     first      last                      email
0  Mohamed  El-sadek  mohamedel-sadek@gmail.com
1    Ahmed   Mohamed     ahmedmohamed@email.com
2     John     Smith          johndoe@email.com

In [28]:
df['email'].apply(len)

0    25
1    22
2    17
Name: email, dtype: int64

In [29]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [30]:
len(df['email'])

3

In [31]:
df.apply(pd.Series.min)

first                     Ahmed
last                   El-sadek
email    ahmedmohamed@email.com
dtype: object

In [32]:
df.apply(lambda x: x.min())

first                     Ahmed
last                   El-sadek
email    ahmedmohamed@email.com
dtype: object

In [33]:
df.applymap(len)

   first  last  email
0      7     8     25
1      5     7     22
2      4     5     17

In [34]:
df.applymap(str.lower)

     first      last                      email
0  mohamed  el-sadek  mohamedel-sadek@gmail.com
1    ahmed   mohamed     ahmedmohamed@email.com
2     john     smith          johndoe@email.com

In [35]:
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    NaN
1    NaN
2    NaN
Name: first, dtype: object

In [36]:
df['first'] = df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

In [37]:
df

     first      last                      email
0  Mohamed  El-sadek  mohamedel-sadek@gmail.com
1    Ahmed   Mohamed     ahmedmohamed@email.com
2     John     Smith          johndoe@email.com